read_verilog /root/input/struct.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /root/output/struct_yosys
write_edif /root/output/struct.edif
write_json /root/output/struct.json
